betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_i3c.c
    return status;
}

/*********************************************************************
 * @fn      I3C_FlushAllFifo
 *
 * @brief   Flushes all the I3C FIFOs.
 * 
 * @return  none
 */
void I3C_FlushAllFifo(void)
{
    I3C->CFGR |= (I3C_CFGR_TXFLUSH | I3C_CFGR_RXFLUSH);

    if (I3C->CFGR & I3C_CFGR_CRINIT)
    {
        I3C->CFGR |= (I3C_CFGR_SFLUSH | I3C_CFGR_CFLUSH);
    }
}

/*********************************************************************
 * @fn      I3C_FlushControlFifo
 *
 * @brief   Flushes the I3C control FIFO.
 * 
 * @return  none
 */
void I3C_FlushControlFifo(void)
{
    I3C->CFGR |= I3C_CFGR_CFLUSH;
}

/*********************************************************************
 * @fn      I3C_FlushStatusFifo
 *
 * @brief   Flushes the I3C status FIFO.
 * 
 * @return  none
 */
void I3C_FlushStatusFifo(void)
{
    I3C->CFGR |= I3C_CFGR_SFLUSH;
}

/*********************************************************************
 * @fn      I3C_SetConfigFifo
 *
 * @brief   Set I3C FIFOs configuration.
 * 
 * @param   pConfig The pointer to the I3C_FifoConfTypeDef structure 
 *        that contains the configuration information for the I3C FIFOs.
 * 
 * @return  none
 */
void I3C_SetConfigFifo(I3C_FifoConfTypeDef *pConfig)
{
    uint32_t value, mask;

    value = (pConfig->TxFifoThreshold | pConfig->RxFifoThreshold);

    mask = (I3C_CFGR_TXTHRES | I3C_CFGR_RXTHRES);

    if (I3C->CFGR & I3C_CFGR_CRINIT)
    {
        value |= (pConfig->StatusFifo | pConfig->ControlFifo);
        mask |= (I3C_CFGR_TMODE | I3C_CFGR_SMODE);
    }

    I3C->CFGR &= ~mask;
    I3C->CFGR |= value;
}

/*********************************************************************
 * @fn      I3C_ClearConfigFifo
 *
 * @brief   Clear I3C FIFOs configuration.
 * 
 * @return  none
 */
void I3C_ClearConfigFifo(void)
{
    uint32_t mask;

    mask = (I3C_CFGR_TXTHRES | I3C_CFGR_RXTHRES);

    if (I3C->CFGR & I3C_CFGR_CRINIT)
    {
        mask |= (I3C_CFGR_TMODE | I3C_CFGR_SMODE);
    }

    I3C->CFGR &= ~mask;
}

/*********************************************************************
 * @fn      I3C_ReadByte
 *
 * @brief   Reads a byte from the I3C bus.
 * 
 * @return  The read byte.
 */
uint8_t I3C_ReadByte(void)
{
    return I3C->RDBR;
}

/*********************************************************************
 * @fn      I3C_ReadWord
 *
 * @brief   Reads a word from the I3C bus.
 * 
 * @return  The read word.
 */
uint32_t I3C_ReadWord(void)
{
    return I3C->RDWR;
}

/*********************************************************************
 * @fn      I3C_WriteByte
 *
 * @brief   Writes a byte to the I3C bus.
 * 
 * @param   Byte - The byte to be written.
 * 
 * @return  none
 */
void I3C_WriteByte(uint8_t Byte)
{
    I3C->TDBR = (uint32_t)Byte;
}

/*********************************************************************
 * @fn      I3C_WriteWord
 *
 * @brief   Writes a word to the I3C bus.
 * 
 * @param   Word - The word to be written.
 * 
 * @return  none
 */
void I3C_WriteWord(uint32_t Word)
{
    I3C->TDWR = Word;
}

/*********************************************************************
 * @fn      I3C_IBIDataConfig
 *
 * @brief   Configure the I3C IBI data to be transmitted.
 * 
 * @param   Data - The data to be transmitted.
 * 
 * @return  none
 */
void I3C_IBIDataConfig(uint32_t Data)
{
    I3C->IBIDR = Data;
}

/*********************************************************************
 * @fn       I3C_GetCCCInfo
 *
 * @brief   Get CCC information for the I3C.
 * 
 * @param   notifyId - pointer to a I3C_Notify_ID_TypeDef enumeration.
 *          pCCCInfo - pointer to a I3C_CCCInfoTypeDef enumeration.
 * 
 * @return  none
 */
void  I3C_GetCCCInfo(I3C_Notify_ID_TypeDef notifyId, I3C_CCCInfoTypeDef *pCCCInfo)
{
    if((notifyId & EVENT_ID_DAU) == EVENT_ID_DAU)
    {
        pCCCInfo->DynamicAddrValid = I3C->DEVR0 & I3C_DEVR0_DAVAL;
        pCCCInfo->DynamicAddress = (I3C->DEVR0 & I3C_DEVR0_DA) >> 1;       
    }
    
    if((notifyId & EVENT_ID_SETMWL) == EVENT_ID_SETMWL)
    {
        pCCCInfo->MaxWriteLength = I3C->MAXWLR & I3C_MAXWLR_MWL;   
    }

    if((notifyId & EVENT_ID_SETMRL) == EVENT_ID_SETMRL)
    {
        pCCCInfo->MaxReadLength = I3C->MAXRLR & I3C_MAXRLR_MRL;     
    }

    if((notifyId & EVENT_ID_RSTACT) == EVENT_ID_RSTACT)
    {
        pCCCInfo->ResetAction = I3C->DEVR0 & I3C_DEVR0_RSTACT; 
    }

    if((notifyId & EVENT_ID_ENTASx) == EVENT_ID_ENTASx)
    {
        pCCCInfo->ActivityState = I3C->DEVR0 & I3C_DEVR0_AS;  
    }

    if((notifyId & EVENT_ID_ENEC_DISEC) == EVENT_ID_ENEC_DISEC)
    {
        pCCCInfo->HotJoinAllowed = (I3C->DEVR0 & I3C_DEVR0_HJEN) >> 19; 
        pCCCInfo->InBandAllowed = (I3C->DEVR0 & I3C_DEVR0_IBIEN) >> 16; 
        pCCCInfo->CtrlRoleAllowed = (I3C->DEVR0 & I3C_DEVR0_CREN) >> 17;   
    }

    if((notifyId & EVENT_ID_IBI) == EVENT_ID_IBI)
    {
        pCCCInfo->IBICRTgtAddr = (I3C->RMR & I3C_RMR_RADD) >> 17; 
        pCCCInfo->IBITgtNbPayload = I3C->RMR & I3C_RMR_IBIRDCNT;
        pCCCInfo->IBITgtPayload = I3C->IBIDR;   
    }

    if((notifyId & EVENT_ID_CR) == EVENT_ID_CR)
    {
        pCCCInfo->IBICRTgtAddr = (I3C->RMR & I3C_RMR_RADD) >> 17;   
    }
}

/*********************************************************************
 * @fn      I3C_ControllerHandleMessage
 *
 * @brief   I3C Message content on the I3C Bus as Controller.
 * 
 * @param   TargetAddr - Specifies the target address to be programmed.
 *            This parameter must be a number from 0 to 0xFF.
 *          TransferSize Specifies the number of bytes to be programmed.
 *            This parameter must be a number from 0 to 0xFFFF. 
 *          Direction - Write or read message.
 *            I3C_Direction_RD - Read message.
 *            I3C_Direction_WR - Write message.
 *          MessageType - Message type.
 *            I3C_CONTROLLER_MessageType0 - Host message type 0.
 *            I3C_CONTROLLER_MessageType1 - Host message type 1.
 *            I3C_CONTROLLER_MessageType2 - Host message type 2.
 *            I3C_CONTROLLER_MessageType3 - Host message type 3.   
 *            I3C_CONTROLLER_MessageType4 - Host message type 4.  
 *          EndMode - Message end mode.
 *            I3C_EndMode_0 - Message end mode 0.
 *            I3C_EndMode_1 - Message end mode 1.
 *
 * @return  none
 */
void I3C_ControllerHandleMessage(uint32_t TargetAddr, uint32_t TransferSize,
                                 uint32_t Direction, uint32_t MessageType, uint32_t EndMode)
{
    I3C->CTLR = ((uint32_t)(TargetAddr << 17) | (uint32_t)(TransferSize) | Direction | MessageType | EndMode);
}

/*********************************************************************
 * @fn      I3C_ControllerHandleCCC
 *
 * @brief   I3C Common Command Code content on the I3C Bus as Controller.
 * 
 * @param   CCCValue - Specifies the Command Code to be programmed.
 *            This parameter must be a number from 0 to 0xFF.
 *          AddByteSize - Specifies the number of CCC additional bytes to be programmed.
 *            This parameter must be a number from 0 to 0xFFFF. 
 *          EndMode - Message end mode.
 *            I3C_EndMode_0 - Message end mode 0.
 *            I3C_EndMode_1 - Message end mode 1.
 *
 * @return  none
 */
void I3C_ControllerHandleCCC(uint32_t CCCValue, uint32_t AddByteSize, uint32_t EndMode)
{
    I3C->CTLR = CCCValue | AddByteSize | EndMode;
}

/*********************************************************************
 * @fn      I3C_TargetHandleMessage
 *
 * @brief   I3C Message content on the I3C Bus as Target.
 * 
 * @param   IBISize - Specifies the number of IBI bytes.
 *            This parameter must be a number from 0 to 0xFFFF. 
 *          MessageType - Message end mode.
 *            I3C_TARGET_MessageType0 - Target message type 0.
 *            I3C_TARGET_MessageType1 - Target message type 1.
 *            I3C_TARGET_MessageType2 - Target message type 2.
 *
 * @return  none
 */
void I3C_TargetHandleMessage(uint32_t MessageType, uint32_t IBISize)
{
    I3C->CTLR = MessageType | IBISize;
}

/*********************************************************************
 * @fn      I3C_GetMessageDirection
 *
 * @brief   Get Message identifier.
 * 
 * @return  0 - Write. 
 *          1 - Read.
 */
uint8_t I3C_GetMessageDirection(void)
{
    return ((uint8_t)((I3C->STATR & I3C_STATR_DIR) >> 18));
}

/*********************************************************************
 * @fn      I3C_GetTargetAbortPrivateRead
 *
 * @brief   Indicates if a Target abort a private read command.
 * 
 * @return  0 - Target no end reading message early. 
 *          1 - Target end reading message early. .
 */
uint8_t I3C_GetTargetAbortPrivateRead(void)
{
    return ((uint8_t)((I3C->STATR & I3C_STATR_ABT) >> 17));
}

/*********************************************************************
 * @fn      I3C_GetGetXferDataCount
 *
 * @brief   Get the number of data during a Transfer.
 * 
 * @return  The number of data during a Transfer.
 */
uint16_t I3C_GetGetXferDataCount(void)
{
    return ((uint16_t)(I3C->STATR));
}

/*********************************************************************
 * @fn      I3C_GetMessageIdentifier
 *
 * @brief   Get Message identifier.
 * 
 * @return  Message identifier.
 */
uint8_t I3C_GetMessageIdentifier(void)
{
    return ((uint8_t)((I3C->STATR & I3C_STATR_MID) >> 24));
}

/*********************************************************************
 * @fn      I3C_GetGetIBITargetAddr
 *
 * @brief   Get the target address received during accepted IBI or Controller-role request.
 * 
 * @return  The target address received during accepted IBI or Controller-role request.
 */
uint8_t I3C_GetGetIBITargetAddr(void)
{
    return ((uint8_t)((I3C->RMR & I3C_RMR_RADD) >> 17));
}

/*********************************************************************
 * @fn      I3C_GetReceiveCommandCode
 *
 * @brief   Get CCC code of received command.
 * 
 * @return  CCC code of received command.
 */
uint8_t I3C_GetReceiveCommandCode(void)
{
    return ((uint8_t)((I3C->RMR & I3C_RMR_RCODE) >> 8));
}

/*********************************************************************
 * @fn      I3C_GetGetNbIBIAddData
 *
 * @brief   Get the number of data bytes received when reading IBI data (controller mode).
 * 
 * @return  The number of data bytes received when reading IBI data
 */
uint8_t I3C_GetGetNbIBIAddData(void)
{
    return ((uint8_t)(I3C->RMR & I3C_RMR_IBIRDCNT));
}

/*********************************************************************
 * @fn      I3C_GetGetResetAction
 *
 * @brief   Get Reset Action (Target only).
 * 
 * @return  0 - reset action none.
 *          1 - reset action partial.
 *          2 - reset action full.
 */
uint8_t I3C_GetGetResetAction(void)
{
    return ((uint8_t)((I3C->DEVR0 & 0x00C00000) >> 22));
}

/*********************************************************************
 * @fn      I3C_GetAllowedPayloadUpdate
 *
 * @brief   Indicates if update of the Device Characteristics Register 
 *        is Allowed or Not Allowed.
 * @param   DeviceIndex - Specifies the index value of the device in the DEVRx register.
 *            I3C_DeviceIndex_1 - Device Index 1.
 *            I3C_DeviceIndex_2 - Device Index 2.
 *            I3C_DeviceIndex_3 - Device Index 3.
 *            I3C_DeviceIndex_4 - Device Index 4.
 * 
 * @return  NewState - ENABLE or DISABLE
 */
FunctionalState I3C_GetAllowedPayloadUpdate(uint32_t DeviceIndex)
{
    FunctionalState NewState = DISABLE;

    if(DeviceIndex == I3C_DeviceIndex_1)
    {
        if(I3C->DEVR1 & I3C_DEVR1_DIS)
        {
            NewState = ENABLE;
        } 
    }
    else if(DeviceIndex == I3C_DeviceIndex_2)
    {
        if(I3C->DEVR2 & I3C_DEVR2_DIS)
        {
            NewState = ENABLE;
        } 
    }
    else if(DeviceIndex == I3C_DeviceIndex_3)
    {
        if(I3C->DEVR3 & I3C_DEVR3_DIS)
        {
            NewState = ENABLE;
        } 
    }
    else if(DeviceIndex == I3C_DeviceIndex_4)
    {
        if(I3C->DEVR4 & I3C_DEVR4_DIS)
        {
            NewState = ENABLE;
        } 
    }

    return NewState;
}

/*********************************************************************
 * @fn      I3C_GetMIPIInstanceID
 *
 * @brief   Get the MIPI Instance ID.
 * 
 * @return  The MIPI Instance ID.
 */
uint8_t I3C_GetMIPIInstanceID(void)
{
    return ((uint8_t)((I3C->EPIDR & I3C_EPIDR_MIPIID) >> 12));
}

/*********************************************************************
 * @fn      I3C_GetIDTypeSelector
 *
 * @brief   Get the ID type selector.
 * 
 * @return  The ID type selector.
 */
uint8_t I3C_GetIDTypeSelector(void)
{
    return ((uint8_t)((I3C->EPIDR & I3C_EPIDR_IDTSEL) >> 16));
}

/*********************************************************************
 * @fn      I3C_GetMIPIManufacturerID
 *
 * @brief   Get the MIPI Manufacturer ID.
 * 
 * @return  The MIPI Manufacturer ID.
 */
uint16_t I3C_GetMIPIManufacturerID(void)
{
    return ((uint16_t)((I3C->EPIDR & I3C_EPIDR_MIPIMID) >> 17));
}

/*********************************************************************
 * @fn      I3C_ITConfig
 *
 * @brief   Enables or disables the specified I3C interrupt.
 * 
 * @param   I3C_IT - The interrupt to be enabled or disabled.
 *            I3C_IT_GRPIE - DEFGRPA CCC and RX FIFO interrupt.
 *            I3C_IT_DEFIE - DEFTGTS CCC and RX FIFO interrupt.
 *            I3C_IT_INTUPDIE - ENEC/DISEC CCC interrupt.
 *            I3C_IT_ASUPDIE - ENTASx CCC interrupt.
 *            I3C_IT_RSTIE - reset pattern interrupt.
 *            I3C_IT_MRLUPDIE - SETMRL CCC interrupt.
 *            I3C_IT_MWLUPDIE - SETMWL CCC interrupt.
 *            I3C_IT_DAUPDIE - ENTDAA/RSTDAA/SETNEWDA CCC interrupt.
 *            I3C_IT_STAIE - GETSTATUS CCC interrupt.
 *            I3C_IT_GETIE - GETxxx CCC interrupt.
 *            I3C_IT_WKPIE - wakeup interrupt.
 *            I3C_IT_HJIE - Hot-join interrupt.
 *            I3C_IT_CRUPDIE - controller-role update interrupt.
 *            I3C_IT_CRIE - Controller-role request interrupt.
 *            I3C_IT_IBIENDIE - IBI end interrupt.
 *            I3C_IT_IBIIE - IBI request interrupt.
 *            I3C_IT_ERRIE - error interrupt.
 *            I3C_IT_RXTGTENDIE - Target-initiated read end interrupt.
 *            I3C_IT_FCIE - Frame end interrupt.
 *            I3C_IT_RXFNEIE - RX-FIFO not empty interrupt.
 *            I3C_IT_TXFNEIE - TX-FIFO not full interrupt.
 *            I3C_IT_CFNFIE - Control FIFO not full interrupt.   
 *            I3C_IT_SFNEIE - Status FIFO not empty interrupt.        
 *          NewState - The new state of the interrupt.
 * 
 * @return  none
 */
void I3C_ITConfig(uint32_t I3C_IT, FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
        I3C->INTENR |= I3C_IT;
    }
    else
    {
        I3C->INTENR &= (uint32_t)~I3C_IT;
    }
}

/*********************************************************************
 * @fn      I3C_GetITStatus
 *
 * @brief   Checks whether the specified I3C interrupt flag is set or not.
 * 
 * @param   I3C_IT - specifies the interrupt flag to check.
 *            I3C_IT_GRPIE - DEFGRPA CCC and RX FIFO interrupt.
 *            I3C_IT_DEFIE - DEFTGTS CCC and RX FIFO interrupt.
 *            I3C_IT_INTUPDIE - ENEC/DISEC CCC interrupt.
 *            I3C_IT_ASUPDIE - ENTASx CCC interrupt.
 *            I3C_IT_RSTIE - reset pattern interrupt.
 *            I3C_IT_MRLUPDIE - SETMRL CCC interrupt.
 *            I3C_IT_MWLUPDIE - SETMWL CCC interrupt.
 *            I3C_IT_DAUPDIE - ENTDAA/RSTDAA/SETNEWDA CCC interrupt.
 *            I3C_IT_STAIE - GETSTATUS CCC interrupt.
 *            I3C_IT_GETIE - GETxxx CCC interrupt.
 *            I3C_IT_WKPIE - wakeup interrupt.
 *            I3C_IT_HJIE - Hot-join interrupt.
 *            I3C_IT_CRUPDIE - controller-role update interrupt.
 *            I3C_IT_CRIE - Controller-role request interrupt.
 *            I3C_IT_IBIENDIE - IBI end interrupt.
 *            I3C_IT_IBIIE - IBI request interrupt.
 *            I3C_IT_ERRIE - error interrupt.
 *            I3C_IT_RXTGTENDIE - Target-initiated read end interrupt.
 *            I3C_IT_FCIE - Frame end interrupt.
 *            I3C_IT_RXFNEIE - RX-FIFO not empty interrupt.
 *            I3C_IT_TXFNEIE - TX-FIFO not full interrupt.
 *            I3C_IT_CFNFIE - Control FIFO not full interrupt.   
 *            I3C_IT_SFNEIE - Status FIFO not empty interrupt.    
 * 
 * @return  ITStatus - SET or RESET.
 */
ITStatus I3C_GetITStatus(uint32_t I3C_IT)
{
    ITStatus bitstatus    = RESET;
    uint32_t enablestatus = I3C->INTENR;

