betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_i3c.c
    if (((I3C->EVR & I3C_IT) != (uint32_t)RESET) && enablestatus)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      I3C_ClearITPendingBit
 *
 * @brief   Clears the specified I3C interrupt flag.
 * 
 * @param   I3C_IT - specifies the interrupt flag to clear.
 *            I3C_IT_GRPIE - DEFGRPA CCC and RX FIFO interrupt.
 *            I3C_IT_DEFIE - DEFTGTS CCC and RX FIFO interrupt.
 *            I3C_IT_INTUPDIE - ENEC/DISEC CCC interrupt.
 *            I3C_IT_ASUPDIE - ENTASx CCC interrupt.
 *            I3C_IT_RSTIE - reset pattern interrupt.
 *            I3C_IT_MRLUPDIE - SETMRL CCC interrupt.
 *            I3C_IT_MWLUPDIE - SETMWL CCC interrupt.
 *            I3C_IT_DAUPDIE - ENTDAA/RSTDAA/SETNEWDA CCC interrupt.
 *            I3C_IT_STAIE - GETSTATUS CCC interrupt.
 *            I3C_IT_GETIE - GETxxx CCC interrupt.
 *            I3C_IT_WKPIE - wakeup interrupt.
 *            I3C_IT_HJIE - Hot-join interrupt.
 *            I3C_IT_CRUPDIE - controller-role update interrupt.
 *            I3C_IT_CRIE - Controller-role request interrupt.
 *            I3C_IT_IBIENDIE - IBI end interrupt.
 *            I3C_IT_IBIIE - IBI request interrupt.
 *            I3C_IT_ERRIE - error interrupt.
 *            I3C_IT_RXTGTENDIE - Target-initiated read end interrupt.
 *            I3C_IT_FCIE - Frame end interrupt.  
 * 
 * @return  none
 */
void I3C_ClearITPendingBit(uint32_t I3C_IT)
{
    I3C->CEVR = I3C_IT;
}

/*********************************************************************
 * @fn      I3C_GetFlagStatus
 *
 * @brief   Checks whether the specified I3C flag is set or not.
 * 
 * @param   I3C_FLAG - specifies the flag to check.
 *            I3C_FLAG_CFEF - Control FIFO not empty flag 
 *            I3C_FLAG_TXFEF - Tx FIFO empty flag               
 *            I3C_FLAG_CFNFF - Control FIFO not full flag      
 *            I3C_FLAG_SFNEF - Status FIFO not empty flag      
 *            I3C_FLAG_TXFNFF - Tx FIFO not full flag            
 *            I3C_FLAG_RXFNEF - Rx FIFO not empty flag           
 *            I3C_FLAG_TXLASTF - Last written data byte/word flag 
 *            I3C_FLAG_RXLASTF - Last read data byte/word flag    
 *            I3C_FLAG_FCF - Frame complete flag              
 *            I3C_FLAG_RXTGTENDF - Target-initiated read end flag   
 *            I3C_FLAG_ERRF - Error flag                       
 *            I3C_FLAG_IBIF - IBI request flag                 
 *            I3C_FLAG_IBIENDF - IBI end flag                     
 *            I3C_FLAG_CRF - Controller-role request flag     
 *            I3C_FLAG_CRUPDF - Controller-role update flag      
 *            I3C_FLAG_HJF - Hot-join flag                    
 *            I3C_FLAG_WKPF - Wakeup flag                      
 *            I3C_FLAG_GETF - GETxxx CCC flag                  
 *            I3C_FLAG_STAF - Format 1 GETSTATUS CCC flag      
 *            I3C_FLAG_DAUPDF - ENTDAA/RSTDAA/SETNEWDA CCC flag  
 *            I3C_FLAG_MWLUPDF - SETMWL CCC flag                  
 *            I3C_FLAG_MRLUPDF - SETMRL CCC flag                  
 *            I3C_FLAG_RSTF - Reset pattern flag               
 *            I3C_FLAG_ASUPDF - ENTASx CCC flag                  
 *            I3C_FLAG_INTUPDF - ENEC/DISEC CCC flag              
 *            I3C_FLAG_DEFF - DEFTGTS CCC flag                 
 *            I3C_FLAG_GRPF - DEFGRPA CCC flag                  
 * 
 * @return  FlagStatus - SET or RESET.
 */
FlagStatus I3C_GetFlagStatus(uint32_t I3C_FLAG)
{
    FlagStatus bitstatus = RESET;

    if ((I3C->EVR & I3C_FLAG) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      I3C_GetErrorStatus
 *
 * @brief   Checks whether the specified I3C error flag is set or not.
 * 
 * @param   I3C_Error - specifies the error flag to check.
 *            I3C_ERROR_CE0 - CE0 error
 *            I3C_ERROR_CE1 - CE1 error
 *            I3C_ERROR_CE2 - CE2 error
 *            I3C_ERROR_CE3 - CE3 error
 *            I3C_ERROR_TE0 - TE0 error
 *            I3C_ERROR_TE1 - TE1 error
 *            I3C_ERROR_TE2 - TE2 error
 *            I3C_ERROR_TE3 - TE3 error
 *            I3C_ERROR_TE4 - TE4 error
 *            I3C_ERROR_TE5 - TE5 error
 *            I3C_ERROR_TE6 - TE6 error
 *            I3C_ERROR_PERR - protocol error
 *            I3C_ERROR_STALL - SCL stall error
 *            I3C_ERROR_DOVR - Rx FIFO Over-Run or Tx FIFO Under-Run error
 *            I3C_ERROR_COVR - S FIFO Over-Run or C FIFO Under-Run error 
 *            I3C_ERROR_ADDRESS_NACK - address not acknowledged error 
 *            I3C_ERROR_DATA_NACK - data not acknowledged error
 *            I3C_ERROR_DATA_HAND_OFF - data error during controller-role hand-off process
 * @return   FlagStatus - SET or RESET.
 */
FlagStatus I3C_GetErrorStatus(uint32_t I3C_Error)
{
    FlagStatus bitstatus = RESET;

    if ((I3C->STATER & I3C_Error) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      I3C_ClearFlag
 *
 * @brief   Clears the specified I3C flag.
 * 
 * @param   I3C_FLAG - specifies the flag to clear.  
 *            I3C_FLAG_FCF - Frame complete flag              
 *            I3C_FLAG_RXTGTENDF - Target-initiated read end flag   
 *            I3C_FLAG_ERRF - Error flag                       
 *            I3C_FLAG_IBIF - IBI request flag                 
 *            I3C_FLAG_IBIENDF - IBI end flag                     
 *            I3C_FLAG_CRF - Controller-role request flag     
 *            I3C_FLAG_CRUPDF - Controller-role update flag      
 *            I3C_FLAG_HJF - Hot-join flag                    
 *            I3C_FLAG_WKPF - Wakeup flag                      
 *            I3C_FLAG_GETF - GETxxx CCC flag                  
 *            I3C_FLAG_STAF - Format 1 GETSTATUS CCC flag      
 *            I3C_FLAG_DAUPDF - ENTDAA/RSTDAA/SETNEWDA CCC flag  
 *            I3C_FLAG_MWLUPDF - SETMWL CCC flag                  
 *            I3C_FLAG_MRLUPDF - SETMRL CCC flag                  
 *            I3C_FLAG_RSTF - Reset pattern flag               
 *            I3C_FLAG_ASUPDF - ENTASx CCC flag                  
 *            I3C_FLAG_INTUPDF - ENEC/DISEC CCC flag              
 *            I3C_FLAG_DEFF - DEFTGTS CCC flag                 
 *            I3C_FLAG_GRPF - DEFGRPA CCC flag   
 * 
 * @return  none
 */
void I3C_ClearFlag(uint32_t I3C_FLAG)
{
    I3C->CEVR = I3C_FLAG;
}
